MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3HNFYFG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM3H0.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM3H0' Device Series
 * @version V1.0.9.0
 * $Date:: 2017-12-27 #$
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LICENSE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA MICROELECTRONICS CORPORATION 2017 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZ_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM3H0
  * @{
  */

#ifndef __TMPM3H0_H__
#define __TMPM3H0_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM3H0 Specific Interrupt Numbers *******************************************************************/
  INT00_IRQn                    = 0,         /*!< Interrupt Pin0                                              */
  INT01_IRQn                    = 1,         /*!< Interrupt Pin1                                              */
  INT02_IRQn                    = 2,         /*!< Interrupt Pin2                                              */
  INT03_IRQn                    = 3,         /*!< Interrupt Pin3                                              */
  INT04_IRQn                    = 4,         /*!< Interrupt Pin4                                              */
  INT05_IRQn                    = 5,         /*!< Interrupt Pin5                                              */
  INTEMG0_IRQn                  = 16,        /*!< PMD0 EMG interrupt                                          */
  INTOVV0_IRQn                  = 17,        /*!< PMD0 OVV interrupt                                          */
  INTPMD0_IRQn                  = 18,        /*!< PMD0 interrupt                                              */
  INTENC00_IRQn                 = 19,        /*!< Encoder 0 interrupt 0                                       */
  INTENC01_IRQn                 = 20,        /*!< Encoder 0 interrupt 1                                       */
  INTADAPDA_IRQn                = 21,        /*!< ADC conversion triggered by PMD is finished A               */
  INTADAPDB_IRQn                = 22,        /*!< ADC conversion triggered by PMD is finished B               */
  INTADACP0_IRQn                = 23,        /*!< ADC conversion monitoring function interrupt 0              */
  INTADACP1_IRQn                = 24,        /*!< ADC conversion monitoring function interrupt 1              */
  INTADATRG_IRQn                = 25,        /*!< ADC conversion triggered by General purpose is finished     */
  INTADASGL_IRQn                = 26,        /*!< ADC conversion triggered by Single program is finished      */
  INTADACNT_IRQn                = 27,        /*!< ADC conversion triggered by Continuity program is finished  */
  INTT0RX_IRQn                  = 28,        /*!< TSPI/SIO reception (channel 0)                              */
  INTT0TX_IRQn                  = 29,        /*!< TSPI/SIO transmit (channel 0)                               */
  INTT0ERR_IRQn                 = 30,        /*!< TSPI/SIO error (channel 0)                                  */
  INTI2CWUP_IRQn                = 34,        /*!< Serial bus interface (WakeUp) interrupt (channel 0)         */
  INTI2C0_IRQn                  = 35,        /*!< I2C0 transmission and reception interrupt                   */
  INTI2C0AL_IRQn                = 36,        /*!< I2C0 arbitration lost interrupt                             */
  INTI2C0BF_IRQn                = 37,        /*!< I2C0 bus free interrupt                                     */
  INTI2C0NA_IRQn                = 38,        /*!< I2C0 no ack interrupt                                       */
  INTUART0RX_IRQn               = 47,        /*!< UART reception (channel 0)                                  */
  INTUART0TX_IRQn               = 48,        /*!< UART transmit (channel 0)                                   */
  INTUART0ERR_IRQn              = 49,        /*!< UART error (channel 0)                                      */
  INTUART1RX_IRQn               = 50,        /*!< UART reception (channel 1)                                  */
  INTUART1TX_IRQn               = 51,        /*!< UART transmit (channel 1)                                   */
  INTUART1ERR_IRQn              = 52,        /*!< UART error (channel 1)                                      */
  INTT32A00A_IRQn               = 56,        /*!< 32bit T32A00A compare match detection 0 / Over flow / under flow*/
  INTT32A00ACAP0_IRQn           = 57,        /*!< 32bit T32A00A input capture 0                               */
  INTT32A00ACAP1_IRQn           = 58,        /*!< 32bit T32A00A input capture 1                               */
  INTT32A00B_IRQn               = 59,        /*!< 32bit T32A00B compare match detection 0 / Over flow / under flow*/
  INTT32A00BCAP0_IRQn           = 60,        /*!< 32bit T32A00B input capture 0                               */
  INTT32A00BCAP1_IRQn           = 61,        /*!< 32bit T32A00B input capture 1                               */
  INTT32A00C_IRQn               = 62,        /*!< 32bit T32A00C compare match detection 0 / Over flow / under flow*/
  INTT32A00CCAP0_IRQn           = 63,        /*!< 32bit T32A00C input capture 0                               */
  INTT32A00CCAP1_IRQn           = 64,        /*!< 32bit T32A00C input capture 1                               */
  INTT32A01A_IRQn               = 65,        /*!< 32bit T32A01A compare match detection 0 / Over flow / under flow*/
  INTT32A01ACAP0_IRQn           = 66,        /*!< 32bit T32A01A input capture 0                               */
  INTT32A01ACAP1_IRQn           = 67,        /*!< 32bit T32A01A input capture 1                               */
  INTT32A01B_IRQn               = 68,        /*!< 32bit T32A01B compare match detection 0 / Over flow / under flow*/
  INTT32A01BCAP0_IRQn           = 69,        /*!< 32bit T32A01B input capture 0                               */
  INTT32A01BCAP1_IRQn           = 70,        /*!< 32bit T32A01B input capture 1                               */
  INTT32A01C_IRQn               = 71,        /*!< 32bit T32A01C compare match detection 0 / Over flow / under flow*/
  INTT32A01CCAP0_IRQn           = 72,        /*!< 32bit T32A01C input capture 0                               */
  INTT32A01CCAP1_IRQn           = 73,        /*!< 32bit T32A01C input capture 1                               */
  INTT32A02A_IRQn               = 74,        /*!< 32bit T32A02A compare match detection 0 / Over flow / under flow*/
  INTT32A02ACAP0_IRQn           = 75,        /*!< 32bit T32A02A input capture 0                               */
  INTT32A02ACAP1_IRQn           = 76,        /*!< 32bit T32A02A input capture 1                               */
  INTT32A02B_IRQn               = 77,        /*!< 32bit T32A02B compare match detection 0 / Over flow / under flow*/
  INTT32A02BCAP0_IRQn           = 78,        /*!< 32bit T32A02B input capture 0                               */
  INTT32A02BCAP1_IRQn           = 79,        /*!< 32bit T32A02B input capture 1                               */
  INTT32A02C_IRQn               = 80,        /*!< 32bit T32A02C compare match detection 0 / Over flow / under flow*/
  INTT32A02CCAP0_IRQn           = 81,        /*!< 32bit T32A02C input capture 0                               */
  INTT32A02CCAP1_IRQn           = 82,        /*!< 32bit T32A02C input capture 1                               */
  INTT32A03A_IRQn               = 83,        /*!< 32bit T32A03A compare match detection 0 / Over flow / under flow*/
  INTT32A03ACAP0_IRQn           = 84,        /*!< 32bit T32A03A input capture 0                               */
  INTT32A03ACAP1_IRQn           = 85,        /*!< 32bit T32A03A input capture 1                               */
  INTT32A03B_IRQn               = 86,        /*!< 32bit T32A03B compare match detection 0 / Over flow / under flow*/
  INTT32A03BCAP0_IRQn           = 87,        /*!< 32bit T32A03B input capture 0                               */
  INTT32A03BCAP1_IRQn           = 88,        /*!< 32bit T32A03B input capture 1                               */
  INTT32A03C_IRQn               = 89,        /*!< 32bit T32A03C compare match detection 0 / Over flow / under flow*/
  INTT32A03CCAP0_IRQn           = 90,        /*!< 32bit T32A03C input capture 0                               */
  INTT32A03CCAP1_IRQn           = 91,        /*!< 32bit T32A03C input capture 1                               */
  INTT32A04A_IRQn               = 92,        /*!< 32bit T32A04A compare match detection 0 / Over flow / under flow*/
  INTT32A04ACAP0_IRQn           = 93,        /*!< 32bit T32A04A input capture 0                               */
  INTT32A04ACAP1_IRQn           = 94,        /*!< 32bit T32A04A input capture 1                               */
  INTT32A04B_IRQn               = 95,        /*!< 32bit T32A04B compare match detection 0 / Over flow / under flow*/
  INTT32A04BCAP0_IRQn           = 96,        /*!< 32bit T32A04B input capture 0                               */
  INTT32A04BCAP1_IRQn           = 97,        /*!< 32bit T32A04B input capture 1                               */
  INTT32A04C_IRQn               = 98,        /*!< 32bit T32A04C compare match detection 0 / Over flow / under flow*/
  INTT32A04CCAP0_IRQn           = 99,        /*!< 32bit T32A04C input capture 0                               */
  INTT32A04CCAP1_IRQn           = 100,       /*!< 32bit T32A04C input capture 1                               */
  INTT32A05A_IRQn               = 101,       /*!< 32bit T32A05A compare match detection 0 / Over flow / under flow*/
  INTT32A05ACAP0_IRQn           = 102,       /*!< 32bit T32A05A input capture 0                               */
  INTT32A05ACAP1_IRQn           = 103,       /*!< 32bit T32A05A input capture 1                               */
  INTT32A05B_IRQn               = 104,       /*!< 32bit T32A05B compare match detection 0 / Over flow / under flow*/
  INTT32A05BCAP0_IRQn           = 105,       /*!< 32bit T32A05B input capture 0                               */
  INTT32A05BCAP1_IRQn           = 106,       /*!< 32bit T32A05B input capture 1                               */
  INTT32A05C_IRQn               = 107,       /*!< 32bit T32A05C compare match detection 0 / Over flow / under flow*/
  INTT32A05CCAP0_IRQn           = 108,       /*!< 32bit T32A05C input capture 0                               */
  INTT32A05CCAP1_IRQn           = 109,       /*!< 32bit T32A05C input capture 1                               */
  INTDMAATC_IRQn                = 110,       /*!< DMA end of transfer                                         */
  INTDMAAERR_IRQn               = 111,       /*!< DMA transfer error                                          */
  INTRMC0_IRQn                  = 114,       /*!< Remote control reception interrupt                          */
  INTFLCRDY_IRQn                = 115,       /*!< Code FLASH Ready interrupt                                  */
  INTFLDRDY_IRQn                = 116        /*!< Data FLASH Ready interrupt                                  */
} IRQn_Type;

